updated the readme
